# UinPerInDegreeF Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..UinPerInDegreeF Property
SymbolTypeId Class See Also
---
Symbol µin/(in·°F), indicating unit Microinches per inch degree Fahrenheit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId UinPerInDegreeF { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UinPerInDegreeF As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ UinPerInDegreeF {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace